results/20260626_152323_all_stress/go-fiber/k6_stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/puvish/Projects/python-bun-go-rust-perf-comparison/k6/stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m40s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 1m10s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/200 VUs, 674 complete and 0 interrupted iterations
default   [   1% ] 001/200 VUs  0m01.0s/1m10.0s

running (0m02.0s), 002/200 VUs, 1482 complete and 0 interrupted iterations
default   [   3% ] 002/200 VUs  0m02.0s/1m10.0s

running (0m03.0s), 002/200 VUs, 2579 complete and 0 interrupted iterations
default   [   4% ] 002/200 VUs  0m03.0s/1m10.0s

running (0m04.0s), 003/200 VUs, 3806 complete and 0 interrupted iterations
default   [   6% ] 003/200 VUs  0m04.0s/1m10.0s

running (0m05.0s), 003/200 VUs, 5113 complete and 0 interrupted iterations
default   [   7% ] 003/200 VUs  0m05.0s/1m10.0s

running (0m06.0s), 004/200 VUs, 6481 complete and 0 interrupted iterations
default   [   9% ] 004/200 VUs  0m06.0s/1m10.0s

running (0m07.0s), 005/200 VUs, 7857 complete and 0 interrupted iterations
default   [  10% ] 005/200 VUs  0m07.0s/1m10.0s

running (0m08.0s), 005/200 VUs, 9276 complete and 0 interrupted iterations
default   [  11% ] 005/200 VUs  0m08.0s/1m10.0s

running (0m09.0s), 006/200 VUs, 10703 complete and 0 interrupted iterations
default   [  13% ] 006/200 VUs  0m09.0s/1m10.0s

running (0m10.0s), 006/200 VUs, 12140 complete and 0 interrupted iterations
default   [  14% ] 006/200 VUs  0m10.0s/1m10.0s

running (0m11.0s), 007/200 VUs, 13600 complete and 0 interrupted iterations
default   [  16% ] 007/200 VUs  0m11.0s/1m10.0s

running (0m12.0s), 008/200 VUs, 15063 complete and 0 interrupted iterations
default   [  17% ] 008/200 VUs  0m12.0s/1m10.0s

running (0m13.0s), 008/200 VUs, 16537 complete and 0 interrupted iterations
default   [  19% ] 008/200 VUs  0m13.0s/1m10.0s

running (0m14.0s), 009/200 VUs, 18002 complete and 0 interrupted iterations
default   [  20% ] 009/200 VUs  0m14.0s/1m10.0s

running (0m15.0s), 009/200 VUs, 19487 complete and 0 interrupted iterations
default   [  21% ] 009/200 VUs  0m15.0s/1m10.0s

running (0m16.0s), 012/200 VUs, 20967 complete and 0 interrupted iterations
default   [  23% ] 012/200 VUs  0m16.0s/1m10.0s

running (0m17.0s), 015/200 VUs, 22492 complete and 0 interrupted iterations
default   [  24% ] 015/200 VUs  0m17.0s/1m10.0s

running (0m18.0s), 018/200 VUs, 23989 complete and 0 interrupted iterations
default   [  26% ] 018/200 VUs  0m18.0s/1m10.0s

running (0m19.0s), 021/200 VUs, 25484 complete and 0 interrupted iterations
default   [  27% ] 021/200 VUs  0m19.0s/1m10.0s

running (0m20.0s), 024/200 VUs, 26954 complete and 0 interrupted iterations
default   [  29% ] 024/200 VUs  0m20.0s/1m10.0s

running (0m21.0s), 027/200 VUs, 28416 complete and 0 interrupted iterations
default   [  30% ] 027/200 VUs  0m21.0s/1m10.0s

running (0m22.0s), 030/200 VUs, 29892 complete and 0 interrupted iterations
default   [  31% ] 030/200 VUs  0m22.0s/1m10.0s

running (0m23.0s), 033/200 VUs, 31372 complete and 0 interrupted iterations
default   [  33% ] 033/200 VUs  0m23.0s/1m10.0s

running (0m24.0s), 036/200 VUs, 32811 complete and 0 interrupted iterations
default   [  34% ] 036/200 VUs  0m24.0s/1m10.0s

running (0m25.0s), 039/200 VUs, 34246 complete and 0 interrupted iterations
default   [  36% ] 039/200 VUs  0m25.0s/1m10.0s

running (0m26.0s), 042/200 VUs, 35697 complete and 0 interrupted iterations
default   [  37% ] 042/200 VUs  0m26.0s/1m10.0s

running (0m27.0s), 045/200 VUs, 37128 complete and 0 interrupted iterations
default   [  39% ] 045/200 VUs  0m27.0s/1m10.0s

running (0m28.0s), 048/200 VUs, 38563 complete and 0 interrupted iterations
default   [  40% ] 048/200 VUs  0m28.0s/1m10.0s

running (0m29.0s), 051/200 VUs, 39969 complete and 0 interrupted iterations
default   [  41% ] 051/200 VUs  0m29.0s/1m10.0s

running (0m30.0s), 054/200 VUs, 41354 complete and 0 interrupted iterations
default   [  43% ] 054/200 VUs  0m30.0s/1m10.0s

running (0m31.0s), 057/200 VUs, 42745 complete and 0 interrupted iterations
default   [  44% ] 057/200 VUs  0m31.0s/1m10.0s

running (0m32.0s), 060/200 VUs, 44148 complete and 0 interrupted iterations
default   [  46% ] 060/200 VUs  0m32.0s/1m10.0s

running (0m33.0s), 063/200 VUs, 45563 complete and 0 interrupted iterations
default   [  47% ] 063/200 VUs  0m33.0s/1m10.0s

running (0m34.0s), 066/200 VUs, 46919 complete and 0 interrupted iterations
default   [  49% ] 066/200 VUs  0m34.0s/1m10.0s

running (0m35.0s), 069/200 VUs, 48302 complete and 0 interrupted iterations
default   [  50% ] 069/200 VUs  0m35.0s/1m10.0s

running (0m36.0s), 072/200 VUs, 49730 complete and 0 interrupted iterations
default   [  51% ] 072/200 VUs  0m36.0s/1m10.0s

running (0m37.0s), 075/200 VUs, 51152 complete and 0 interrupted iterations
default   [  53% ] 075/200 VUs  0m37.0s/1m10.0s

running (0m38.0s), 078/200 VUs, 52557 complete and 0 interrupted iterations
default   [  54% ] 078/200 VUs  0m38.0s/1m10.0s

running (0m39.0s), 081/200 VUs, 54007 complete and 0 interrupted iterations
default   [  56% ] 081/200 VUs  0m39.0s/1m10.0s

running (0m40.0s), 084/200 VUs, 55415 complete and 0 interrupted iterations
default   [  57% ] 084/200 VUs  0m40.0s/1m10.0s

running (0m41.0s), 087/200 VUs, 56838 complete and 0 interrupted iterations
default   [  59% ] 087/200 VUs  0m41.0s/1m10.0s

running (0m42.0s), 090/200 VUs, 58277 complete and 0 interrupted iterations
default   [  60% ] 090/200 VUs  0m42.0s/1m10.0s

running (0m43.0s), 093/200 VUs, 59710 complete and 0 interrupted iterations
default   [  61% ] 093/200 VUs  0m43.0s/1m10.0s

running (0m44.0s), 096/200 VUs, 61122 complete and 0 interrupted iterations
default   [  63% ] 096/200 VUs  0m44.0s/1m10.0s

running (0m45.0s), 099/200 VUs, 62579 complete and 0 interrupted iterations
default   [  64% ] 099/200 VUs  0m45.0s/1m10.0s

running (0m46.0s), 106/200 VUs, 63996 complete and 0 interrupted iterations
default   [  66% ] 106/200 VUs  0m46.0s/1m10.0s

running (0m47.0s), 113/200 VUs, 65457 complete and 0 interrupted iterations
default   [  67% ] 113/200 VUs  0m47.0s/1m10.0s

running (0m48.0s), 119/200 VUs, 66912 complete and 0 interrupted iterations
default   [  69% ] 119/200 VUs  0m48.0s/1m10.0s

running (0m49.0s), 126/200 VUs, 68361 complete and 0 interrupted iterations
default   [  70% ] 126/200 VUs  0m49.0s/1m10.0s

running (0m50.0s), 133/200 VUs, 69770 complete and 0 interrupted iterations
default   [  71% ] 133/200 VUs  0m50.0s/1m10.0s

running (0m51.0s), 139/200 VUs, 71229 complete and 0 interrupted iterations
default   [  73% ] 139/200 VUs  0m51.0s/1m10.0s

running (0m52.0s), 146/200 VUs, 72677 complete and 0 interrupted iterations
default   [  74% ] 146/200 VUs  0m52.0s/1m10.0s

running (0m53.0s), 153/200 VUs, 74130 complete and 0 interrupted iterations
default   [  76% ] 153/200 VUs  0m53.0s/1m10.0s

running (0m54.0s), 159/200 VUs, 75606 complete and 0 interrupted iterations
default   [  77% ] 159/200 VUs  0m54.0s/1m10.0s

running (0m55.0s), 166/200 VUs, 77074 complete and 0 interrupted iterations
default   [  79% ] 166/200 VUs  0m55.0s/1m10.0s

running (0m56.0s), 173/200 VUs, 78524 complete and 0 interrupted iterations
default   [  80% ] 173/200 VUs  0m56.0s/1m10.0s

running (0m57.0s), 179/200 VUs, 80009 complete and 0 interrupted iterations
default   [  81% ] 179/200 VUs  0m57.0s/1m10.0s

running (0m58.0s), 186/200 VUs, 81458 complete and 0 interrupted iterations
default   [  83% ] 186/200 VUs  0m58.0s/1m10.0s

running (0m59.0s), 193/200 VUs, 82907 complete and 0 interrupted iterations
default   [  84% ] 193/200 VUs  0m59.0s/1m10.0s

running (1m00.0s), 199/200 VUs, 84395 complete and 0 interrupted iterations
default   [  86% ] 199/200 VUs  1m00.0s/1m10.0s

running (1m01.0s), 185/200 VUs, 85811 complete and 0 interrupted iterations
default   [  87% ] 185/200 VUs  1m01.0s/1m10.0s

running (1m02.0s), 162/200 VUs, 87190 complete and 0 interrupted iterations
default   [  89% ] 162/200 VUs  1m02.0s/1m10.0s

running (1m03.0s), 142/200 VUs, 88643 complete and 0 interrupted iterations
default   [  90% ] 142/200 VUs  1m03.0s/1m10.0s

running (1m04.0s), 123/200 VUs, 90133 complete and 0 interrupted iterations
default   [  91% ] 123/200 VUs  1m04.0s/1m10.0s

running (1m05.0s), 103/200 VUs, 91578 complete and 0 interrupted iterations
default   [  93% ] 103/200 VUs  1m05.0s/1m10.0s

running (1m06.0s), 082/200 VUs, 93041 complete and 0 interrupted iterations
default   [  94% ] 082/200 VUs  1m06.0s/1m10.0s

running (1m07.0s), 063/200 VUs, 94413 complete and 0 interrupted iterations
default   [  96% ] 063/200 VUs  1m07.0s/1m10.0s

running (1m08.0s), 041/200 VUs, 95865 complete and 0 interrupted iterations
default   [  97% ] 041/200 VUs  1m08.0s/1m10.0s

running (1m09.0s), 021/200 VUs, 97320 complete and 0 interrupted iterations
default   [  99% ] 021/200 VUs  1m09.0s/1m10.0s

running (1m10.0s), 001/200 VUs, 98717 complete and 0 interrupted iterations
default   [ 100% ] 001/200 VUs  1m10.0s/1m10.0s


  █ TOTAL RESULTS 

    checks_total.......: 197484  2821.164326/s
    checks_succeeded...: 100.00% 197484 out of 197484
    checks_failed......: 0.00%   0 out of 197484

    ✓ status 200
    ✓ has DONE

    HTTP
    http_req_duration..............: avg=50.19ms min=903.48µs med=13.28ms max=973.18ms p(90)=146.68ms p(95)=207.49ms
      { expected_response:true }...: avg=50.19ms min=903.48µs med=13.28ms max=973.18ms p(90)=146.68ms p(95)=207.49ms
    http_req_failed................: 0.00%  0 out of 98742
    http_reqs......................: 98742  1410.582163/s

    EXECUTION
    iteration_duration.............: avg=50.34ms min=988.23µs med=13.44ms max=973.26ms p(90)=146.87ms p(95)=207.69ms
    iterations.....................: 98742  1410.582163/s
    vus............................: 1      min=1          max=199
    vus_max........................: 200    min=200        max=200

    NETWORK
    data_received..................: 798 MB 11 MB/s
    data_sent......................: 16 MB  230 kB/s



running (1m10.0s), 000/200 VUs, 98742 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m10s